БИТУправление_медицинским_центром_демо/src/Enums/ВидыСтавокНДС/ВидыСтавокНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтавокНДС</name>
  <enumValues>
    <name>Общая</name>
  </enumValues>
  <enumValues>
    <name>ОбщаяРасчетная</name>
  </enumValues>
  <enumValues>
    <name>Пониженная</name>
  </enumValues>
  <enumValues>
    <name>ПониженнаяРасчетная</name>
  </enumValues>
  <enumValues>
    <name>Нулевая</name>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>НДС18</name>
    <comment>Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>Расчетная ставка НДС 18/118</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>Расчетная ставка НДС 10/110</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>Расчетная ставка НДС 20/120</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыСтавокНДС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Определяет конкретную ставку НДС, действующую в указанный день, по виду ставки.
//
// Параметры:
//  СтавкаНДС	 - ПеречислениеСсылка.СтавкиНДС	 - вид ставки товарной позиции.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыСтавокНДС.
//
Функция ВидСтавки(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Общая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ОбщаяРасчетная;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Пониженная;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Нулевая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Возврат Перечисления.ВидыСтавокНДС.БезНДС;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Общая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ОбщаяРасчетная;
	Иначе
		Возврат Перечисления.ВидыСтавокНДС.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
